Revit 2027 API
FabricationNetworkChangeService.SetMapOfInLinePartTypes Method
 Set the mapping of fabrication part types for in-line parts for the service and palette to change to.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetMapOfInLinePartTypes(
	IDictionary<ElementId, ElementId> fabricationPartTypes
)
Public Sub SetMapOfInLinePartTypes (
	fabricationPartTypes As IDictionary(Of ElementId, ElementId)
)
public:
void SetMapOfInLinePartTypes(
	IDictionary<ElementId^, ElementId^>^ fabricationPartTypes
)
member SetMapOfInLinePartTypes :
        fabricationPartTypes : IDictionary<ElementId, ElementId> -> unit
Parameters
fabricationPartTypes IDictionary<ElementId, ElementId>
 The map containing the original fabrication part type to the fabrication part type to change to.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace